{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "data", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 260, 260, 3], "dtype": "float32", "sparse": false, "name": "data"}, "inbound_nodes": []}, {"name": "conv2d_0", "class_name": "Conv2D", "config": {"name": "conv2d_0", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["data", 0, 0, {}]]]}, {"name": "conv2d_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv2d_0_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_0", 0, 0, {}]]]}, {"name": "conv2d_0_activation", "class_name": "Activation", "config": {"name": "conv2d_0_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2d_0_bn", 0, 0, {}]]]}, {"name": "maxpool2d_0", "class_name": "MaxPooling2D", "config": {"name": "maxpool2d_0", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_0_activation", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["maxpool2d_0", 0, 0, {}]]]}, {"name": "conv2d_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2d_1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "conv2d_1_activation", "class_name": "Activation", "config": {"name": "conv2d_1_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2d_1_bn", 0, 0, {}]]]}, {"name": "maxpool2d_1", "class_name": "MaxPooling2D", "config": {"name": "maxpool2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_1_activation", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["maxpool2d_1", 0, 0, {}]]]}, {"name": "conv2d_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv2d_2_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_2_activation", "class_name": "Activation", "config": {"name": "conv2d_2_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2d_2_bn", 0, 0, {}]]]}, {"name": "maxpool2d_2", "class_name": "MaxPooling2D", "config": {"name": "maxpool2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2_activation", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["maxpool2d_2", 0, 0, {}]]]}, {"name": "conv2d_3_bn", "class_name": "BatchNormalization", "config": {"name": "conv2d_3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "conv2d_3_activation", "class_name": "Activation", "config": {"name": "conv2d_3_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2d_3_bn", 0, 0, {}]]]}, {"name": "maxpool2d_3", "class_name": "MaxPooling2D", "config": {"name": "maxpool2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_3_activation", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["maxpool2d_3", 0, 0, {}]]]}, {"name": "conv2d_4_bn", "class_name": "BatchNormalization", "config": {"name": "conv2d_4_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_4_activation", "class_name": "Activation", "config": {"name": "conv2d_4_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2d_4_bn", 0, 0, {}]]]}, {"name": "maxpool2d_4", "class_name": "MaxPooling2D", "config": {"name": "maxpool2d_4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_4_activation", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["maxpool2d_4", 0, 0, {}]]]}, {"name": "conv2d_5_bn", "class_name": "BatchNormalization", "config": {"name": "conv2d_5_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "conv2d_5_activation", "class_name": "Activation", "config": {"name": "conv2d_5_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2d_5_bn", 0, 0, {}]]]}, {"name": "maxpool2d_5", "class_name": "MaxPooling2D", "config": {"name": "maxpool2d_5", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_5_activation", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["maxpool2d_5", 0, 0, {}]]]}, {"name": "conv2d_6_bn", "class_name": "BatchNormalization", "config": {"name": "conv2d_6_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "conv2d_6_activation", "class_name": "Activation", "config": {"name": "conv2d_6_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2d_6_bn", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_6_activation", 0, 0, {}]]]}, {"name": "conv2d_7_bn", "class_name": "BatchNormalization", "config": {"name": "conv2d_7_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "conv2d_7_activation", "class_name": "Activation", "config": {"name": "conv2d_7_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2d_7_bn", 0, 0, {}]]]}, {"name": "cls_0_insert_conv2d", "class_name": "Conv2D", "config": {"name": "cls_0_insert_conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_3_activation", 0, 0, {}]]]}, {"name": "cls_1_insert_conv2d", "class_name": "Conv2D", "config": {"name": "cls_1_insert_conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_4_activation", 0, 0, {}]]]}, {"name": "cls_2_insert_conv2d", "class_name": "Conv2D", "config": {"name": "cls_2_insert_conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_5_activation", 0, 0, {}]]]}, {"name": "cls_3_insert_conv2d", "class_name": "Conv2D", "config": {"name": "cls_3_insert_conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_6_activation", 0, 0, {}]]]}, {"name": "cls_4_insert_conv2d", "class_name": "Conv2D", "config": {"name": "cls_4_insert_conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_7_activation", 0, 0, {}]]]}, {"name": "loc_0_insert_conv2d", "class_name": "Conv2D", "config": {"name": "loc_0_insert_conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_3_activation", 0, 0, {}]]]}, {"name": "loc_1_insert_conv2d", "class_name": "Conv2D", "config": {"name": "loc_1_insert_conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_4_activation", 0, 0, {}]]]}, {"name": "loc_2_insert_conv2d", "class_name": "Conv2D", "config": {"name": "loc_2_insert_conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_5_activation", 0, 0, {}]]]}, {"name": "loc_3_insert_conv2d", "class_name": "Conv2D", "config": {"name": "loc_3_insert_conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_6_activation", 0, 0, {}]]]}, {"name": "loc_4_insert_conv2d", "class_name": "Conv2D", "config": {"name": "loc_4_insert_conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_7_activation", 0, 0, {}]]]}, {"name": "cls_0_insert_conv2d_bn", "class_name": "BatchNormalization", "config": {"name": "cls_0_insert_conv2d_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["cls_0_insert_conv2d", 0, 0, {}]]]}, {"name": "cls_1_insert_conv2d_bn", "class_name": "BatchNormalization", "config": {"name": "cls_1_insert_conv2d_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["cls_1_insert_conv2d", 0, 0, {}]]]}, {"name": "cls_2_insert_conv2d_bn", "class_name": "BatchNormalization", "config": {"name": "cls_2_insert_conv2d_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["cls_2_insert_conv2d", 0, 0, {}]]]}, {"name": "cls_3_insert_conv2d_bn", "class_name": "BatchNormalization", "config": {"name": "cls_3_insert_conv2d_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["cls_3_insert_conv2d", 0, 0, {}]]]}, {"name": "cls_4_insert_conv2d_bn", "class_name": "BatchNormalization", "config": {"name": "cls_4_insert_conv2d_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["cls_4_insert_conv2d", 0, 0, {}]]]}, {"name": "loc_0_insert_conv2d_bn", "class_name": "BatchNormalization", "config": {"name": "loc_0_insert_conv2d_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["loc_0_insert_conv2d", 0, 0, {}]]]}, {"name": "loc_1_insert_conv2d_bn", "class_name": "BatchNormalization", "config": {"name": "loc_1_insert_conv2d_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["loc_1_insert_conv2d", 0, 0, {}]]]}, {"name": "loc_2_insert_conv2d_bn", "class_name": "BatchNormalization", "config": {"name": "loc_2_insert_conv2d_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["loc_2_insert_conv2d", 0, 0, {}]]]}, {"name": "loc_3_insert_conv2d_bn", "class_name": "BatchNormalization", "config": {"name": "loc_3_insert_conv2d_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["loc_3_insert_conv2d", 0, 0, {}]]]}, {"name": "loc_4_insert_conv2d_bn", "class_name": "BatchNormalization", "config": {"name": "loc_4_insert_conv2d_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["loc_4_insert_conv2d", 0, 0, {}]]]}, {"name": "cls_0_insert_conv2d_activation", "class_name": "Activation", "config": {"name": "cls_0_insert_conv2d_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["cls_0_insert_conv2d_bn", 0, 0, {}]]]}, {"name": "cls_1_insert_conv2d_activation", "class_name": "Activation", "config": {"name": "cls_1_insert_conv2d_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["cls_1_insert_conv2d_bn", 0, 0, {}]]]}, {"name": "cls_2_insert_conv2d_activation", "class_name": "Activation", "config": {"name": "cls_2_insert_conv2d_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["cls_2_insert_conv2d_bn", 0, 0, {}]]]}, {"name": "cls_3_insert_conv2d_activation", "class_name": "Activation", "config": {"name": "cls_3_insert_conv2d_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["cls_3_insert_conv2d_bn", 0, 0, {}]]]}, {"name": "cls_4_insert_conv2d_activation", "class_name": "Activation", "config": {"name": "cls_4_insert_conv2d_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["cls_4_insert_conv2d_bn", 0, 0, {}]]]}, {"name": "loc_0_insert_conv2d_activation", "class_name": "Activation", "config": {"name": "loc_0_insert_conv2d_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["loc_0_insert_conv2d_bn", 0, 0, {}]]]}, {"name": "loc_1_insert_conv2d_activation", "class_name": "Activation", "config": {"name": "loc_1_insert_conv2d_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["loc_1_insert_conv2d_bn", 0, 0, {}]]]}, {"name": "loc_2_insert_conv2d_activation", "class_name": "Activation", "config": {"name": "loc_2_insert_conv2d_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["loc_2_insert_conv2d_bn", 0, 0, {}]]]}, {"name": "loc_3_insert_conv2d_activation", "class_name": "Activation", "config": {"name": "loc_3_insert_conv2d_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["loc_3_insert_conv2d_bn", 0, 0, {}]]]}, {"name": "loc_4_insert_conv2d_activation", "class_name": "Activation", "config": {"name": "loc_4_insert_conv2d_activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["loc_4_insert_conv2d_bn", 0, 0, {}]]]}, {"name": "cls_0_conv", "class_name": "Conv2D", "config": {"name": "cls_0_conv", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["cls_0_insert_conv2d_activation", 0, 0, {}]]]}, {"name": "cls_1_conv", "class_name": "Conv2D", "config": {"name": "cls_1_conv", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["cls_1_insert_conv2d_activation", 0, 0, {}]]]}, {"name": "cls_2_conv", "class_name": "Conv2D", "config": {"name": "cls_2_conv", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["cls_2_insert_conv2d_activation", 0, 0, {}]]]}, {"name": "cls_3_conv", "class_name": "Conv2D", "config": {"name": "cls_3_conv", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["cls_3_insert_conv2d_activation", 0, 0, {}]]]}, {"name": "cls_4_conv", "class_name": "Conv2D", "config": {"name": "cls_4_conv", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["cls_4_insert_conv2d_activation", 0, 0, {}]]]}, {"name": "loc_0_conv", "class_name": "Conv2D", "config": {"name": "loc_0_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["loc_0_insert_conv2d_activation", 0, 0, {}]]]}, {"name": "loc_1_conv", "class_name": "Conv2D", "config": {"name": "loc_1_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["loc_1_insert_conv2d_activation", 0, 0, {}]]]}, {"name": "loc_2_conv", "class_name": "Conv2D", "config": {"name": "loc_2_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["loc_2_insert_conv2d_activation", 0, 0, {}]]]}, {"name": "loc_3_conv", "class_name": "Conv2D", "config": {"name": "loc_3_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["loc_3_insert_conv2d_activation", 0, 0, {}]]]}, {"name": "loc_4_conv", "class_name": "Conv2D", "config": {"name": "loc_4_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["loc_4_insert_conv2d_activation", 0, 0, {}]]]}, {"name": "cls_0_reshape", "class_name": "Reshape", "config": {"name": "cls_0_reshape", "trainable": true, "dtype": "float32", "target_shape": [-1, 2]}, "inbound_nodes": [[["cls_0_conv", 0, 0, {}]]]}, {"name": "cls_1_reshape", "class_name": "Reshape", "config": {"name": "cls_1_reshape", "trainable": true, "dtype": "float32", "target_shape": [-1, 2]}, "inbound_nodes": [[["cls_1_conv", 0, 0, {}]]]}, {"name": "cls_2_reshape", "class_name": "Reshape", "config": {"name": "cls_2_reshape", "trainable": true, "dtype": "float32", "target_shape": [-1, 2]}, "inbound_nodes": [[["cls_2_conv", 0, 0, {}]]]}, {"name": "cls_3_reshape", "class_name": "Reshape", "config": {"name": "cls_3_reshape", "trainable": true, "dtype": "float32", "target_shape": [-1, 2]}, "inbound_nodes": [[["cls_3_conv", 0, 0, {}]]]}, {"name": "cls_4_reshape", "class_name": "Reshape", "config": {"name": "cls_4_reshape", "trainable": true, "dtype": "float32", "target_shape": [-1, 2]}, "inbound_nodes": [[["cls_4_conv", 0, 0, {}]]]}, {"name": "loc_0_reshape", "class_name": "Reshape", "config": {"name": "loc_0_reshape", "trainable": true, "dtype": "float32", "target_shape": [-1, 4]}, "inbound_nodes": [[["loc_0_conv", 0, 0, {}]]]}, {"name": "loc_1_reshape", "class_name": "Reshape", "config": {"name": "loc_1_reshape", "trainable": true, "dtype": "float32", "target_shape": [-1, 4]}, "inbound_nodes": [[["loc_1_conv", 0, 0, {}]]]}, {"name": "loc_2_reshape", "class_name": "Reshape", "config": {"name": "loc_2_reshape", "trainable": true, "dtype": "float32", "target_shape": [-1, 4]}, "inbound_nodes": [[["loc_2_conv", 0, 0, {}]]]}, {"name": "loc_3_reshape", "class_name": "Reshape", "config": {"name": "loc_3_reshape", "trainable": true, "dtype": "float32", "target_shape": [-1, 4]}, "inbound_nodes": [[["loc_3_conv", 0, 0, {}]]]}, {"name": "loc_4_reshape", "class_name": "Reshape", "config": {"name": "loc_4_reshape", "trainable": true, "dtype": "float32", "target_shape": [-1, 4]}, "inbound_nodes": [[["loc_4_conv", 0, 0, {}]]]}, {"name": "cls_0_activation", "class_name": "Activation", "config": {"name": "cls_0_activation", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["cls_0_reshape", 0, 0, {}]]]}, {"name": "cls_1_activation", "class_name": "Activation", "config": {"name": "cls_1_activation", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["cls_1_reshape", 0, 0, {}]]]}, {"name": "cls_2_activation", "class_name": "Activation", "config": {"name": "cls_2_activation", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["cls_2_reshape", 0, 0, {}]]]}, {"name": "cls_3_activation", "class_name": "Activation", "config": {"name": "cls_3_activation", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["cls_3_reshape", 0, 0, {}]]]}, {"name": "cls_4_activation", "class_name": "Activation", "config": {"name": "cls_4_activation", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["cls_4_reshape", 0, 0, {}]]]}, {"name": "loc_branch_concat", "class_name": "Concatenate", "config": {"name": "loc_branch_concat", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["loc_0_reshape", 0, 0, {}], ["loc_1_reshape", 0, 0, {}], ["loc_2_reshape", 0, 0, {}], ["loc_3_reshape", 0, 0, {}], ["loc_4_reshape", 0, 0, {}]]]}, {"name": "cls_branch_concat", "class_name": "Concatenate", "config": {"name": "cls_branch_concat", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["cls_0_activation", 0, 0, {}], ["cls_1_activation", 0, 0, {}], ["cls_2_activation", 0, 0, {}], ["cls_3_activation", 0, 0, {}], ["cls_4_activation", 0, 0, {}]]]}], "input_layers": [["data", 0, 0]], "output_layers": [["loc_branch_concat", 0, 0], ["cls_branch_concat", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}